app/views/posts/index.html.erb

        <span><%= post.tags %></span>
        <span class="author"><%= User.find(post.id_user).name %></span>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]