app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    @post.id_user = current_user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "id_user", "tags", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "hhhhhh"], ["created_at", "2014-11-13 15:13:16.863191"], ["id_user", 1], ["tags", ""], ["title", "ggggg"], ["updated_at", "2014-11-13 15:13:16.863191"]]

  def update
    respond_to do |format|
      if @current_user_creator
        if @post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "title" = ?, "updated_at" = ? WHERE "posts"."id" = 4  [["body", "This is great"], ["title", "Google"], ["updated_at", "2014-11-17 20:36:17.627305"]]

  def destroy
    if @current_user_creator
      @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]

    def set_posts
      @posts = Post.all
---
SELECT "posts".* FROM "posts"